/*
 Navicat Premium Data Transfer

 Source Server         : MySQL57
 Source Server Type    : MySQL
 Source Server Version : 50710
 Source Host           : localhost:3306
 Source Schema         : yctu

 Target Server Type    : MySQL
 Target Server Version : 50710
 File Encoding         : 65001

 Date: 29/11/2022 13:46:12
*/

SET NAMES utf8mb4;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
-- Table structure for admin
-- ----------------------------
DROP TABLE IF EXISTS `admin`;
CREATE TABLE `admin`  (
  `mid` int(11) NOT NULL AUTO_INCREMENT,
  `username` varchar(20) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `password` varchar(20) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `truename` varchar(20) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `phone` varchar(20) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  PRIMARY KEY (`mid`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 11 CHARACTER SET = utf8 COLLATE = utf8_general_ci ROW_FORMAT = DYNAMIC;

-- ----------------------------
-- Records of admin
-- ----------------------------
INSERT INTO `admin` VALUES (1, 'admin1', '123456', '于文波', '13342522232');
INSERT INTO `admin` VALUES (2, 'admin2', '123456', '马阳泽', '14949629983');
INSERT INTO `admin` VALUES (3, 'admin3', '123456', '谢子轩', '13362400734');
INSERT INTO `admin` VALUES (4, 'admin4', '123456', '金鸿德', '19312738158');
INSERT INTO `admin` VALUES (5, 'admin5', '123456', '谭景澄', '14909537745');
INSERT INTO `admin` VALUES (6, 'admin6', '123456', '龚群', '19968458697');
INSERT INTO `admin` VALUES (7, 'admin7', '123456', '马博文', '18090235270');
INSERT INTO `admin` VALUES (8, 'admin8', '123456', '方高远', '19198777306');
INSERT INTO `admin` VALUES (9, 'admin9', '123456', '郑德庸', '17744197241');
INSERT INTO `admin` VALUES (10, 'admin10', '123456', '范斌蔚', '18979097594');

-- ----------------------------
-- Table structure for comment
-- ----------------------------
DROP TABLE IF EXISTS `comment`;
CREATE TABLE `comment`  (
  `name` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `headimg` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `ctime` datetime(0) NULL DEFAULT NULL,
  `cid` int(11) NOT NULL AUTO_INCREMENT,
  `userid` int(11) NULL DEFAULT NULL,
  `content` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `reply` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  PRIMARY KEY (`cid`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 10 CHARACTER SET = utf8 COLLATE = utf8_general_ci ROW_FORMAT = DYNAMIC;

-- ----------------------------
-- Records of comment
-- ----------------------------
INSERT INTO `comment` VALUES ('长发哥', '/profile/b985db99-a112-4f96-aeba-c2f8a67f7bf4.jpg', '2022-10-19 10:26:35', 1, 1, '感谢', '不用谢');
INSERT INTO `comment` VALUES ('噩梦哥', '/profile/649d1c6c-00f9-4d1b-9d3e-7793c51bdbf4.jpg', '2022-11-15 21:14:56', 2, 3, '感谢守稻人网站成功保护我的水稻', '感谢支持');
INSERT INTO `comment` VALUES ('大婶', '/profile/2ff4b84b-2499-483d-89ec-3d27ce4a79fc.jpg', '2022-11-15 22:06:55', 3, 2, '识别效果不好啊', '会继续改进的，请多多支持');
INSERT INTO `comment` VALUES ('噩梦哥', '/profile/649d1c6c-00f9-4d1b-9d3e-7793c51bdbf4.jpg', '2022-11-16 11:12:53', 5, 3, '识别种类太少', NULL);
INSERT INTO `comment` VALUES ('AAA农药批发张大龙', '/profile/5be60131-0ddf-4a7b-beda-7c5f5431689d.png', '2022-11-16 14:31:54', 6, 7, '请问一下，可不可以增加虫害种类', '已收到！');
INSERT INTO `comment` VALUES ('son', '/profile/default.png', '2022-11-16 16:39:18', 7, 6, '么么么么么么', NULL);

-- ----------------------------
-- Table structure for pest
-- ----------------------------
DROP TABLE IF EXISTS `pest`;
CREATE TABLE `pest`  (
  `kind` int(11) NULL DEFAULT NULL,
  `name` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `place` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `time` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `content` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `infourl` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `info` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `basic` varchar(400) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `bio` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `agr` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `pestid` int(11) NOT NULL AUTO_INCREMENT,
  PRIMARY KEY (`pestid`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 19 CHARACTER SET = utf8 COLLATE = utf8_general_ci ROW_FORMAT = DYNAMIC;

-- ----------------------------
-- Records of pest
-- ----------------------------
INSERT INTO `pest` VALUES (1, '稻瘟病', '华南稻区、长江中下游稻区、西南稻区、北方稻区、黄淮稻区', '7月中下旬', '一般在水稻分蘖盛期盛发，病菌侵染叶片初期产生水溃状褐点，感病品种很快形成大的圆形或椭圆形褐斑，严重时病斑密布，叶片枯焦，全株中毒萎缩，根腐枯死。', '/pest/1f221d2c-33bf-4743-b7d0-28c1583e940f.jpg', '稻瘟病又名稻热病、火烧瘟、叩头瘟等，是由稻瘟病原菌引起的、发生在水稻的一种病害。稻瘟病在水稻整个生育期中都可发生，为害秧苗、叶片、穗、节等，分别称为苗瘟、叶瘟、穗瘟和节瘟', '稻瘟病在水稻各生育期和各个部位均可发生。根据发病时期和发病部位可分为苗瘟、叶瘟、叶枕瘟、节瘟、穗颈瘟、枝梗瘟、谷粒瘟等。其中以叶瘟、穗颈瘟最为常见，危害较大。叶瘟严重时，全田呈火烧状，新叶不易伸长，植株矮缩，抽穗艰难。抽穗期穗瘟发生严重时，导致大量白穗或瘪粒。', '咪鲜胺防治叶温时期在7月上、中旬，叶瘟发生初期用药。要预防穗颈瘟在水稻始穗期、齐穗期各喷一次预防效果明显。', '加强肥、水管理 科学管理肥、水，既可改善环境条件，控制病菌的繁殖和侵染，又可促使水稻健壮生长，提高抗病性，从而获得高产稳产。注意氮、磷、钾配合施用，基肥、有机肥和化肥配合使用，适当施用含硅酸的肥料（如草木灰、矿渣、窑灰钾肥等），做到施足钾肥，早施追肥，中期看苗、看田、看天巧用施肥技术。硅、镁肥混施，可促进硅酸的吸收，能较大幅度地降低发病率。绿肥埋青量要适当，适量施用石灰可促进其腐烂，中和酸性。冷浸田应注意增施磷肥', 1);
INSERT INTO `pest` VALUES (2, '二化螟', '华南稻区、长江中下游稻区、西南稻区、北方稻区、黄淮稻区', '7月到8月之间', '蛀食水稻茎部，为害分蘖期水稻，造成枯鞘和枯心苗；为害孕穗、抽穗期水稻，造成枯孕穗和白穗；为害灌浆、乳熟期水稻，造成半枯穗和虫伤株。', '/pest/5833d9d2-6062-4fc9-97f9-1aa32283fc2d.jpg', '二化螟属鳞翅目，螟蛾科，是我国水稻上危害最为严重的常发性害虫之一，蛀食水稻茎部，为害分蘖期水稻，造成枯鞘和枯心苗；为害孕穗、抽穗期水稻，造成枯孕穗和白穗；为害灌浆、乳熟期水稻，造成半枯穗和虫伤株。为害株田间呈聚集分布，中心明显。', '初孵幼虫先侵入叶鞘集中为害，造成枯鞘，到2～3龄后蛀入茎秆，造成枯心、白穗和虫伤株。初孵幼虫，在苗期水稻上一般分散或几条幼虫集中为害；在大的稻株上，一般先集中为害，至3龄幼虫后才转株为害。', '为充分利用卵期天敌，应尽量避开卵孵盛期用药。一般在早、晚稻分蘖期或晚稻孕穗、抽穗期卵孵高峰后5～7天，当枯鞘丛率5%～8%，或早稻每667平方米有中心受害株100株或丛害率1%～1.5%或晚稻受害团高于100个时，应及时用药防治；未达到防治指标的田块可挑治枯鞘团。二化螟盛发时，水稻处于孕穗抽穗期，防治白穗和虫伤株，以卵盛孵期后15～20天成熟的稻田作为重点防治对象田。', '主要采取消灭越冬虫源、灌水灭虫、避害等措施。冬闲田在冬季或翌年早春3月底以前翻耕灌水。早稻草要放到远离晚稻田的地方曝晒，以防转移危害；晚稻草则要在春暖后化蛹前做燃料处理，烧死幼虫和蛹。4月下旬至5月上旬（化蛹高峰至蛾始盛期），灌水淹没稻桩3～5天，能淹死大部分老熟幼虫和蛹，减少发生基数。尽量避免单、双季稻混栽，可以有效切断虫源田和桥梁田之间的联系，降低虫口数量。不能避免时，单季稻田提早翻耕灌水，降低越冬代数量；双季早稻收割后及时翻耕灌水，防止幼虫转移危害。', 2);
INSERT INTO `pest` VALUES (1, '黑条矮缩病', '华南稻区、长江中下游稻区、黄淮稻区', '6月下旬', '叶色深绿，叶背的叶脉和茎秆上现初蜡白色，后变褐色的短条瘤状隆起，不抽穗或穗小，结实不良。', '/pest/6141333c-e6cd-4af2-a10a-12bd9ec508a9.jpg', '黑条矮缩病。叶色深绿，叶背的叶脉和茎秆上现初蜡白色，后变褐色的短条瘤状隆起，不抽穗或穗小，结实不良。不同生育期染病后的症状略有差异。苗期发病 心叶生长缓慢，叶片短宽、僵直、浓绿，叶脉有不规则蜡白色瘤状突起，后变黑褐色。根短小，植株矮小，不抽穗，常提早枯死。分蘖期发病 新生分蘖先显症，主茎和早期分蘖尚能抽出短小病穗，但病穗缩藏于叶鞘内。拔节期发病 剑叶短阔，穗颈短缩，结实率低。叶背和茎秆上有短条状瘤突。', '简称RBSDV，称稻黑条矮缩病毒，属植物呼肠弧病毒组病毒。病毒粒子为等径对称的球状多面体，大小75-80nm。病毒粒子有衣壳内外二层。细胞质中病毒粒子以三种形式存在：一种是分散或不规则聚集，另一种是有规则的晶状排列，再一种病毒粒子排列成串，外包一层膜呈豆荚状、鞘状或管状构造。病毒钝化温度50-60度，病叶汁液稀释限点10000-10000倍，病叶汁液体外保毒期5-6天。', '武夷菌素能够防治水稻的黑条矮缩病、条纹叶枯病和玉米的粗缩病。', '注意秧田、本田前期防治，还要注意麦田防虫。抓住一代成虫从麦田迁向稻田和二、三代成虫由早稻本田迁向晚稻秧田及玉米上，末代成虫和越冬若虫从晚稻迁到早播麦田的防治。', 3);
INSERT INTO `pest` VALUES (1, '纹枯病', '华南稻区、长江中下游稻区、西南稻区、北方稻区、黄淮稻区', '3月中旬至4月上旬', '是由立枯丝核菌侵染引起的一种真菌病害。是水稻发生最为普遍的主要病害之一，一般早稻重于晚稻，往往造成谷粒不饱满，空壳率增加，严重的可引起植株倒伏枯死。常见于水稻、小麦、谷子等禾本科植物。', '/pest/c37564c4-6ad5-4436-9ecc-d6c2cb884be1.jpg', '纹枯病，是由立枯丝核菌侵染引起的一种真菌病害。是水稻发生最为普遍的主要病害之一，一般早稻重于晚稻，往往造成谷粒不饱满，空壳率增加，严重的可引起植株倒伏枯死。常见于水稻、小麦、谷子等禾本科植物。', '叶鞘染病在近水面处产生暗绿色水浸状边缘模糊小斑，后渐扩大呈椭圆形或云纹形，中部呈灰绿或灰褐色，湿度低时中部呈淡黄或灰白色，中部组织破坏呈半透明状，边缘暗褐。发病严重时数个病斑融合形成大病斑，呈不规则状云纹斑，常致叶片发黄枯死。叶片染病病斑也呈云纹状，边缘褪黄，发病快时病斑呈污绿色，叶片很快腐烂，茎秆受害症状似叶片，后期呈黄褐色，易折。穗颈部受害初为污绿色，后变灰褐，常不能抽穗，抽穗的秕谷较多，千粒重下降。湿度大时，病部长出白色网状菌丝，后汇聚成白色菌丝团，形成菌核，菌核深褐色，易脱落。高温条件下病斑上产生一层白色粉霉层即病菌的担子和担孢子。', '井冈霉素与枯草芽孢杆菌或蜡质芽孢杆菌的复配剂如纹曲宁等药剂，持效期比井冈霉素长，可以选用。丙环唑、烯唑醇、己唑醇等部分唑类杀菌剂对水稻纹枯病防治效果好，持效期较长。烯唑醇、丙环唑等唑类杀菌剂对水稻体内的赤霉素形成有影响，能抑制水稻茎节拔长。但这些杀菌农药在水稻上部3个拔长节间拔长期使用，特别是超量使用，可能影响这些节间的拔长，严重的可造成水稻抽穗不良，出现包颈现象，其中烯唑醇等药制的抑制作用更为明显。高科恶霉灵或苯醚甲环唑与丙环唑或腈菌唑等三唑类的复配剂在水稻抽穗前后可以使用。', '打捞菌核，减少菌源。要每季大面积打捞并带出田外深埋。加强栽培管理，施足基肥，追肥早施，不可偏施氮肥，增施磷钾肥，采用配方施肥技术，使水稻前期不披叶，中期不徒长，后期不贪青。灌水做到分蘖浅水、够苗露田、晒田促根、肥田重晒、瘦田轻晒、长穗湿润、不早断水、防止早衰，要掌握“前浅、中晒、后湿润”的原则。选用良种，根据保山市各稻区的生产特点，在注重高产、优质、熟期适中的前提下，宜选用分蘖能力适中、株型紧凑、叶型较窄的水稻品种；以降低田间荫蔽作用、增加通透性及降低空气相对湿度、提高稻株抗病能力。', 4);
INSERT INTO `pest` VALUES (1, '白叶枯病', '华南稻区、长江中下游稻区、西南稻区、北方稻区、黄淮稻区', '7月至8月中旬', '白叶枯病主要发生于叶片及叶鞘上。初起在叶缘产生半透明黄色小斑，以后沿叶缘一侧或两侧或沿中脉发展成波纹状的黄绿或灰绿色病斑；病部与健部分界线明显；数日后病斑转为灰白色，并向内卷曲，远望一片枯槁色。', '/pest/020e0b6a-bb34-411f-a5ce-678ad5eeb771.jpg', '水稻白叶枯病浴称着凤、过火风、白叶瘟等，是由水稻白叶枯病原细菌引起的、发生在水稻的一种病害。该病为害叶片，也可侵染叶鞘。是中国植物检疫对象。', '白叶枯病主要发生于叶片及叶鞘上。初起在叶缘产生半透明黄色小斑，以后沿叶缘一侧或两侧或沿中脉发展成波纹状的黄绿或灰绿色病斑；病部与健部分界线明显；数日后病斑转为灰白色，并向内卷曲，远望一片枯槁色，故称白叶枯病。', '用强氯精浸种或80%“402”浸种，浸种方法同稻瘟病。选好秧田位置，加强灌溉水管理，防止淹苗。在三叶一心期和移栽前施药预防。亩用25%叶枯宁（又叫川化018）或叶青双可湿性粉剂100克兑水喷雾。', '发生过白叶枯病的田块和低洼易涝田都要种植抗病品种。平整稻田，防止串灌、漫灌传播病害；适时适度晒田，施足底肥，多施P、K肥，不要过量过迟追施氮肥。', 5);
INSERT INTO `pest` VALUES (2, '稻飞虱', '华南稻区、长江中下游稻区、西南稻区、黄淮稻区', '9月上、中旬', '传播植物病毒病。以刺吸植株汁液危害水稻等作物。', '/pest/81a86df3-ad1c-46c0-80e0-dc5fcdd9bab0.jpg', '稻飞虱，属于同翅目飞虱科，俗称蠓子虫、火蠓虫、响虫。以刺吸植株汁液危害水稻等作物。我国为害水稻的飞虱主要有三种：褐飞虱、白背飞虱 和灰飞虱 ，其中以褐飞虱发生和为害最重，白背飞虱次之。', '褐飞虱食性单一，在自然情况下只取食水稻和普通野生稻；白背飞虱主要为害水稻，兼食大麦、小麦、粟、玉米、甘蔗、野生稻、早熟禾、高粱等；灰飞虱取食水稻、小麦、大麦、玉米、高粱、甘蔗等禾本科植物。', '保护利用自然天敌，调整用药时间，改进施药方法，减少施药次数，用药量要合理，以减少对天敌的伤害，达到保护天敌的目的。其次，可采用草把助迁蜘蛛等措施，对防治飞虱有较好效果。', '栽培和管理措施，创造有利于水稻生长发育而不利于稻飞虱发生的环境条件。对水稻种植要合理布局，实行连片种植，防止稻飞虱来回迁移，辗转为害。在水稻生育期，要实行科学管理肥水：施肥要做到控氮、增钾、补磷；灌水要浅水勤灌，适时烤田，使 田间通风透光，降低田间湿度，防止水稻贪青徒长。灰飞虱可结合冬季积肥，清除杂草，消灭越冬虫源。', 6);
INSERT INTO `pest` VALUES (2, '稻纵卷叶螟', '华南稻区、长江中下游稻区、西南稻区、黄淮稻区', '7月上、中旬', '以幼虫为害水稻，缀叶成纵苞，躲藏其中取食上表皮及叶肉，仅留白色下表皮。苗期受害影响水稻正常生长，甚至枯死；分蘖期至拔节期受害，分蘖减少，植株缩短，生育期推迟；孕穗后特别是抽穗到齐穗期剑叶被害，影响开花结实，空壳率提高，千粒重下降。', '/pest/4a7617f8-3999-49cb-8d8e-935d14617773.jpg', '稻纵卷叶螟，别称为刮青虫、白叶虫，苞叶虫等，是中国水稻产区的主要害虫之一，广泛分布于各稻区。除为害水稻外，还可取食大麦、小麦、甘蔗、粟等作物及稗、李氏禾、雀稗、双穗雀稗、马唐、狗尾草、蟋蟀草、茅草、芦苇等杂草。', '以幼虫为害水稻，缀叶成纵苞，躲藏其中取食上表皮及叶肉，仅留白色下表皮。苗期受害影响水稻正常生长，甚至枯死；分蘖期至拔节期受害，分蘖减少，植株缩短，生育期推迟；孕穗后特别是抽穗到齐穗期剑叶被害，影响开花结实，空壳率提高，千粒重下降。', '天敌。稻纵卷叶螟绒茧蜂。稻纵卷叶螟绒茧蜂是专门寄生于纵卷叶螟低龄幼虫期的一种优势种天敌；赤眼蜂螟赤眼蜂和拟澳洲赤眼蜂是寄生稻纵卷叶螟的主要蜂种。以茵治虫。用杀螟杆菌、青虫菌等细菌农药防治稻纵卷叶螟，每亩用100～150克(每克菌粉含活孢子100亿以上)，加水60～75公斤喷雾(土法生产的菌粉，可按含菌量推算)。喷雾时加入药量0．1%的洗衣粉或茶枯粉(即茶子饼粉)作湿润剂，可提高防治效果。', '冬季和早春结合积肥治螟，挖光草子留种田的稻根，捡净春花田的外露稻根，特别注意清除河边、塘边、田边、沟边的杂草，并烧制成焦泥灰。做到治虫积肥一举两得。利用水稻抗性选用抗病虫高产良种，结合合理施肥，防止水稻前期猛发嫩绿，后期恋青迟熟，使水稻生长正常，适期成熟，对减轻为害有一定作用。据徐州地区农科所试验，不同品种具有对虫体成活率差异较大的抗生性。同时，不同品种还具有对产卵的抗选性。', 7);
INSERT INTO `pest` VALUES (1, '恶苗病', '长江中下游稻区、北方稻区', '7月中下旬', '苗期发病病苗比健苗细高，叶片叶鞘细长，叶色淡黄，根系发育不良，部分病苗在移栽前死亡。在枯死苗上有淡红或白色霉粉状物节间明显伸长，节部常有弯曲露于叶鞘外，下部茎节逆生多数不定须根，分蘖少或不分蘖。剥开叶鞘，茎秆上有暗褐条斑，剖开病茎可见白色蛛丝状菌丝，以后植株逐渐枯死。', '/pest/58a1d3b4-f83e-4308-8fd2-97ada29b46be.jpg', '又称徒长病，全国各稻区均有发生。1926年，科学家观察到，当水稻感染了赤霉菌后，会出现植株疯长的现象，病株往往比正常植株高50%以上，而且结实率大大降低，因而称之为“恶苗病”。', '症状：病谷粒播后常不发芽或不能出土。苗期发病病苗比健苗细高，叶片叶鞘细长，叶色淡黄，根系发育不良，部分病苗在移栽前死亡。在枯死苗上有淡红或白色霉粉状物，即病原菌的分生孢子。节间明显伸长，节部常有弯曲露于叶鞘外，下部茎节逆生多数不定须根，分蘖少或不分蘖。剥开叶鞘，茎秆上有暗褐条斑，剖开病茎可见白色蛛丝状菌丝，以后植株逐渐枯死。', '妥善处理病稻草，不能随便乱扔，也不能堆放在田边地头，不能作种子催芽的覆盖物，不能用来捆扎秧把，可集中高温堆沤，严重的或火烧。必要时喷施天达95%恶霉灵或浩瀚高科30%甲霜恶霉灵效果突出。', '严格消毒种子。用50%的多菌灵100克，加水50千克浸种；或35%的恶苗灵120克，加水50千克浸种；或3%的生石灰水浸种48小时。药液浸泡必须注意的是，液面一定要高出种子层面15－20厘米，供种子吸收。同时，在浸种过程中，药液面保持静止状态，中途不能搅拌，也不能重复使用，以保证闷死病菌。', 8);
INSERT INTO `pest` VALUES (1, '稻曲病', '华南稻区、长江中下游稻区、西南稻区、北方稻区、黄淮稻区', '8月中下旬', '在穗部发生，为害稻穗上的部分谷粒。其先在颖壳的合缝处露出淡黄绿色的小菌块，逐渐膨大，最后包裹全颖壳，为墨绿色或橄榄色，最后开裂，布满墨绿色粉末。', '/pest/c99d6427-c18d-4c8e-99f1-01d997698d63.jpg', '稻曲病又称伪黑穗病、绿黑穗病，是由稻绿核菌引起的、发生在水稻上的一种病害。该病仅在穗部发生，为害稻穗上的部分谷粒。其先在颖壳的合缝处露出淡黄绿色的小菌块，逐渐膨大，最后包裹全颖壳，为墨绿色或橄榄色，最后开裂，布满墨绿色粉末。', '稻曲病仅发生在水稻穗部，为害单个谷粒，少则1-2粒，多至十余粒。受害谷粒在内外颖处先裂开，露出淡黄色块状物，逐渐膨大包裹内外颍两侧，呈孢子球，开始很小，逐渐膨大，稍扁平，光滑，外覆盖一层薄膜，随着孢子球膨大而破裂。孢子球的颜色逐渐变为黄绿色至墨绿色，老面平滑，最后龟裂，散出圈绿色粉末，即病原菌的厚垣孢子。切开病球，外层呈墨绿色，第2层为橙黄色，第3层为淡黄色，内层为白色菌丝。有的病球到后期两侧生黑色稍扁平、硬质的菌核2-4粒，经风雨震动很容易脱落在田间越冬。', '第一次施药在破口前8天至破口抽穗20%时，可选用1：1：500的石灰倍量式波尔多液，或15%粉锈宁可湿性粉剂500倍液，或20%瘟曲克星可湿性粉剂500倍液，或14%络氨铜乳油500倍液，或50%琥胶肥酸铜可湿性粉剂500倍液喷雾。第二次在始穗期，可喷洒15.5%保穗宁可湿性粉剂500倍液，或40%禾枯灵可湿性粉剂500倍液，或12.5%敌力康可湿性粉剂2000倍液，或25%施保克乳油600倍液。', '选用抗病品种。建立无病留种田，选用无病种子。合理密植，适时移栽。施足基肥，增施农家肥，少施氮肥，配施磷、钾肥，增施硅肥，慎用穗肥。适时晒田，齐穗后干湿交替。及时摘除病粒带出田外深埋或烧毁。发病稻田水稻收割后要深翻、晒田。（2）种子处理。播前晒种1～2天，再用清水浸泡24小时，然后选用硫酸铜200倍液，或福尔马林50倍液或3%～5%生石灰水浸种3～5小时，也可用50%多菌灵500倍液浸种24小时。药液要盖种，勿动。', 9);
INSERT INTO `pest` VALUES (2, '稻苞虫', '长江中下游稻区、北方稻区', '4月中旬', '水稻受稻苞虫危害后，叶片残缺、植株矮小、稻穗变短、稻谷灌浆不充分、千粒重降低、严重影响水稻产量、一般发生年份减产10%~20%，大发生年份减产50%以上。', '/pest/75e3d94c-8c69-41b1-ad51-85e06f36c831.jpg', '稻苞虫(Parnara guttata Bremer et Grey)属鳞翅目弄蝶科，别名稻弄蝶，是水稻上主要害虫之一，20 世纪90年代各稻区普遍发生，近年来发生呈加重趋势。水稻受稻苞虫危害后，叶片残缺、植株矮小、稻穗变短、稻谷灌浆不充分、千粒重降低、严重影响水稻产量、一般发生年份减产10%~20%，大发生年份减产50%以上。', '稻苞虫，早期危害造成白穗减产，晚期危害大量吞噬绿叶，造成绿叶面积锐减，稻谷灌浆不充分，千粒重低，严重减产，更为严重的是由于稻苞虫危害，导致稻粒黑粉病剧增，收获的稻谷中带病谷粒多，加工时黑粉不易去除，直接影响稻米质量，造成经济损失，威胁消费者的身体健康。直纹稻弄蝶又称直纹稻苞虫。除水稻外，尚食害甘蔗、玉米、麦类、茭白等作物，并能在游草、芦苇、稗等多种杂草上取食存活。抽穗前为害，使稻穗卷曲，无法抽出，或被曲折，不能开花结实，严重影响产量。直纹稻苞虫属鳞翅目，弄蝶科。', '在幼虫为害初期，可摘除虫苞或水稻孕穗前采用梳、拍、捏等方法杀虫苞。一般防治螟虫、稻纵卷叶螟的农药，对此虫也有效，故常可兼治。若发生量较大，需单独防治时，对3龄前幼虫，每亩每次可用18%杀虫双水剂100-150克喷雾，或用2.5%甲敌粉2-2.5千克喷粉；3龄后幼虫，可用90%敌百虫100-150克，或50%杀螟松乳油100克，或50%辛硫磷100克加水50-60升喷雾。也可用B.t.乳剂每亩200克对水50升喷雾防治。', '稻苞虫是水稻上一种食叶害虫，一般在山区、半山区、滨湖地区、新垦稻区、旱改水地区，常间歇发生成灾。幼虫为害水稻，缀叶成苞，蚕食稻叶，减少稻株光合作用面积，使植株矮小，穗短粒小或不实。据调查，稻苞虫在很多乡镇均有发生，大面积呈轻发生态势，还有个别村社发生严重。 （1）冬春季成虫羽化前，结合积肥，铲除田边、沟边、积水塘边的杂草，以消灭越冬虫源。', 10);
INSERT INTO `pest` VALUES (2, '稻三化螟', '华南稻区、长江中下游稻区', '7月到8月之间', '专食水稻，以幼虫蛀茎为害，分蘖期形成枯心，孕穗至抽穗期，形成枯孕穗和白穗，转株为害还形成虫伤株。“枯心苗”及“白穗”是其为害后稻株主要症状。', '/pest/63c20263-22a6-479a-88f6-40f94fda39f8.jpg', '三化螟(钻心虫)属鳞翅目，螟蛾科，广泛分布于长江流域以南稻区，特别是沿江、沿海平原地区受害严重。它食性单一，专食水稻，以幼虫蛀茎为害，分蘖期形成枯心，孕穗至抽穗期，形成枯孕穗和白穗，转株为害还形成虫伤株。“枯心苗”及“白穗”是其为害后稻株主要症状。', '三化螟因在江浙一带每年发生3代而得名，但在广东等地可发生5代。以老熟幼虫在稻桩内越冬，春季气温达16℃时，化蛹羽化飞往稻田产卵。在安徽每年发生3～4代，各代幼虫发生期和为害情况大致为：第一代在6月上中旬，为害早稻和早中稻造成枯心；第二代在7月份为害单季晚稻和迟中稻造成枯心，为害早稻和早中稻造成白穗；第三代在8月上中旬至9月上旬为害双季晚稻造成枯心，为害迟中稻和单季晚稻造成白穗；第四代在9、10月份，为害双季晚稻造成白穗。', '三化螟的天敌种类很多，寄生性的有稻螟赤眼蜂、黑卵蜂和啮小蜂等，捕食性天敌有蜘蛛、青蛙、隐翅虫等。病原微生物如白僵菌等是早春引起幼虫死亡的重要因子。对这些天敌，都应实施保护利用，还可使用生物农药bt、白僵菌等。', '①齐泥割稻、锄劈或拾毁冬作田的外露稻桩；②春耕灌水，淹没稻桩10天；③选择螟害轻的稻田或旱地作绿肥留种田；④减少水稻混栽，选用良种，调整播期，使水稻“危险生育期”避开蚁螟孵化盛期；⑤提高种子纯度，合理施肥和水浆管理。', 11);
INSERT INTO `pest` VALUES (2, '稻大螟', '华南稻区、长江中下游稻区', '7月上、中旬', '幼虫蛀入稻茎为害，可造成枯鞘、枯心苗、枯孕穗、白穗及虫伤株。大螟危害的孔较大，有大量虫粪排出茎外。受害稻茎的叶片、叶鞘部都变为黄色。', '/pest/4e6ba13b-19fe-4b09-bc70-3dfffac6c10d.jpg', '大螟虫源复杂，发生盛期相对较长，再加上钻蛀危害的隐蔽性以及不同药对幼虫作用效果的差异，为获得药剂治螟的理想效果，在选准药剂和掌握用药方法的情况下，如大螟零星或偏轻发生时，可掌握在卵孵至低龄幼虫高峰期用药1次；如大螟达偏重及以上发生时，宜在卵孵始盛期与高峰期连续用药2次，必要时在低龄幼虫高峰期或田间危害始见期再用药复查补治1次。', '大螟可在小麦田为害，主要以越冬代高龄幼虫蛀食茎秆、第1代低龄幼虫为害小麦青穗。小麦成为大螟为害的有效中间寄主，积累了1代大螟基数，使稻田第2代大螟数量迅速上升。同时部分荒芜油菜田块，杂草丛生，也成为大螟的良好过渡环境。', '1、冬春期间铲除田边杂草，消灭其中越冬幼虫和蛹。\r\n\r\n2、防治策略狠治一代，重点防治稻田边行。\r\n\r\n3、有茭白的地区，应在开春前齐泥割去残株。', '农药防治，当当枯鞘率达5%或始见枯心苗危害时大部分幼虫处于1-2龄阶段。推荐用药玉米版六夫丁进行均匀喷雾使用。', 12);
INSERT INTO `pest` VALUES (2, '稻蓟马', '北方稻区、华南稻区、长江中下游稻区', '7月中下旬', '成、若虫以口器锉破叶面，成微细黄白色斑，叶尖两边向内卷折，渐及全叶卷缩枯黄，分蘖初期受害重的稻田，苗不长、根不发、无分蘖，甚至成团枯死。晚稻秧田受害更为严重，常成片枯死，状如火烧。穗期成、若虫趋向穗苞，扬花时，转入颖壳内，为害子房，造成空瘪粒', '/pest/0b9d162e-31e9-48e0-a3aa-720ea4362f33.jpg', '昆虫名，为缨翅目，蓟马科。北起黑龙江、内蒙古自治区、南至广东、广西和云南，东自台湾及各省，西达四川、贵州均有发生。寄主于 水稻、小麦、玉米、粟、高粱、蚕豆、葱、烟草、甘蔗等。 成、若虫以口器锉破叶面，成微细黄白色斑，叶尖两边向内卷折，渐及全叶卷缩枯黄，分蘖初期受害重的稻田，苗不长、根不发、无分蘖，甚至成团枯死。晚稻秧田受害更为严重，常成片枯死，状如火烧。穗期成、若虫趋向穗苞，扬花时，转入颖壳内，为害子房，造成空瘪粒。', '稻蓟马生活周期短，发生代数多，世代重叠，多数以成虫在麦田,茭白及禾本科杂草等处越冬。成虫，常藏身卷叶尖或心叶内，早晚及阴天外出活动，有明显趋嫩绿稻苗产卵习性，卵散产于叶脉间，幼穗形\r\n稻蓟马\r\n稻蓟马(6张)\r\n成后则以心叶上产卵为多。初孵幼虫集中在叶耳、叶舌处，更喜欢在幼嫩心叶上为害。7、8月低温多雨，有利于发生为害；秧苗期、分蘖期和幼穗分化期，是蓟马的严重为害期，尤其是晚稻秧田和本田初期受害更全。', '防治时期：依据稻蓟马的发生为害规律，遭受稻蓟马的为害时期，一是秧苗四、五叶期用药一次，二是本田稻苗返青期。这两个时期应是保护的重点。即在秧田秧苗四、五叶期用药一次，第二次在秧苗移栽前2－3天用药。', '调整种植制度，尽量避免水稻早、中、晚混栽，相对集中播种期和栽秧期，以减少稻蓟马的繁殖桥梁田和辗转为害的机会。合理施肥，在施足基肥的基础上，适期适量追施返青肥，促使秧苗正常生长，减轻为害。防止乱施肥。', 13);
INSERT INTO `pest` VALUES (2, '稻象甲', '华南稻区、长江中下游稻区、西南稻区', '7月中下旬', '成虫以管状喙咬食秧苗茎叶，被害心叶抽出后，轻的呈现一横排小孔，重的秧叶折断，飘浮水面。幼虫食害稻株幼嫩须根，致叶尖发黄，生长不良。严重时不能抽穗，或造成秕谷，甚至成片枯死。', '/pest/c4ecf753-5968-43d6-98eb-df16fb69189a.jpg', '昆虫名，为鞘翅目，象虫科。分布在北起黑龙江，南至广东、海南，西抵陕西、甘肃、四川和云南，东达沿海各地和台湾。寄主于稻，瓜类、番茄、大豆、棉花，成虫偶食麦类、玉米、和油菜等。成虫以管状喙咬食秧苗茎叶，被害心叶抽出后，轻的呈现一横排小孔，重的秧叶折断，飘浮水面。幼虫食害稻株幼嫩须根，致叶尖发黄，生长不良。严重时不能抽穗，或造成秕谷，甚至成片枯死。', '稻象甲成虫以管状喙咬食水稻秧苗心叶，抽出后形成一排小孔，被咬稻叶易折断，漂浮水面，水稻分壤后为害逐渐减轻，玉米、高梁幼苗为害症状与水稻秧苗为害症状相似。稻象甲幼虫为害水稻新根，被害稻株叶尖发黄，叶片枯死，严重时整丛枯死，稻穗不能抽出或形成秕谷，甚至成片枯死', '(1)清洁田园。通过铲草皮、割草或喷施除草剂等措施，破坏稻象甲越冬及柄息场所。\r\n(2)午季作物收获后及时灌水翻耕，消灭部分虫源。\r\n(3)水稻育秧田应尽量选择远离山坡、堤坎等杂草较多的虫源区，并相对集中育秧，减轻为害。', '(4)适当推迟一季中稻播期，避开稻象甲为害高峰期，食源植物大量发生后，可以分散稻象甲为害；同时还可推迟水稻抽穗扬花期，避开7月下旬高温热害，增加结实率。\r\n(5)喷撒农药时，不仅要对秧苗喷药，还要对秧田周围杂草喷药，能起到较好的杀灭和阻隔作用，对为害较重的田块，可增加用药次数。\r\n(6)为提高农药的防治效果，可随药配用农田有机硅助剂“展透”，既增加叶片的农药附着率，叉增加农药对害虫的渗透性', 14);
INSERT INTO `pest` VALUES (2, '福寿螺', '华南稻区、长江中下游稻区、西南稻区', '6月下旬', '以植物性饵料为主的杂食性螺类，主要取食浮萍、蔬菜、瓜果等，尤其喜欢吃带甜味的食物，也爱吃水中的动物腐肉。当没有更多食物时，会食漂在水面的微小物质', '/pest/c299e812-a5a4-4924-b1ae-561f76d3fbb5.jpg', '昆虫名，瓶螺科、瓶螺属软体动物。贝壳外观与田螺相似。具一螺旋状的螺壳，颜色随环境及螺龄不同而异，有光泽和若干条细纵纹，爬行时头部和腹足伸出。', '福寿螺的螺壳锋利，容易划伤农民的手脚，大量粪便可污染水体。与本地物种竞争导致本地淡水生物减少，甚至绝迹，影响水生物多样性。', '在沟渠和水稻移栽后，利用养鸭食螺。放鸭时间为水稻移栽后7-10天至水稻孕穗末期，选择中小体型，鸭龄30天的免疫鸭苗，鸭苗放养密度为20-25只/亩；冬季集中放鸭于沟渠和农田啄食幼螺，减少越冬螺量。由于福寿螺成螺外壳坚硬，生物防治一般无法消灭成螺。', '在春、秋季福寿螺产卵高峰期，在稻田中插些竹片、木条等，引诱福寿螺在这些竹片、木条上集中产卵，每2-3天摘除一次卵块并进行销毁，平时结合农事操作捡螺、消灭卵块；冬季结合冬修水利，整治沟渠，清除淤泥、杂草，破坏福寿螺的越冬场所，降低越冬螺的成活率和冬后的残螺量。此方法较费时费力，在农村劳动力短缺的情况下，很难通过人工防治方法达到防控福寿螺蔓延的效果。', 15);
INSERT INTO `pest` VALUES (1, '稻胡麻斑病', '华南稻区、长江中下游稻区、西南稻区、北方稻区、黄淮稻区', '7月上、中旬', '叶片受害造成叶枯，穗部受害导致千粒重下降及空秕粒增多，影响产量和米质。随着中国水稻生产施肥水平提高和水利条件改善，该病危害日益减轻，但部分地区晚稻秧龄过长时，则发病较多，且引起后期穗枯，造成严重失收。', '/pest/94baa40e-472e-418a-a94d-2e6725241e24.jpg', '水稻胡麻斑病又叫胡麻叶枯病，俗称饥饿病，是由稻平脐蠕孢引起的、发生在水稻的真菌性病害。该病主要为害稻株地上部分，以叶片为多。', '该病在水稻各生育期和地上各部位均可发生，以叶片发病最普遍，其次为谷粒、穗颈和枝梗等。叶片受害后初为小褐点，后扩大为椭圆形褐色病斑，因大小似胡麻籽，故称之为胡麻斑病。病斑边缘明显，外围常有黄色晕圈，后期病斑中央呈灰黄或灰白色。严重时病斑密生，常相联合，形成不规则大斑。谷粒上病斑与叶片上病斑相似，可扩展至全谷粒，湿度大时内外颖合缝处及谷粒表面产生大量黑色绒毛状霉层。穗颈和枝梗受害，症状与稻瘟病相似，但病部呈深褐色，变色部较长。', '用25%咪鲜胺乳油2000倍液浸种。施足基肥，注意氮磷钾的配合施用。实施浅水勤灌，既要避免长期淹灌又要防止缺水受旱。亩用40%稻瘟灵80毫升+30%苯醚甲环唑10毫升+磷酸二氢钾100克+有机硅10克兑水30公斤喷雾，隔2-3天再喷一次。', '由于水稻胡麻斑病在土质差、肥力低的条件下，发病严重，必须注重改良土壤。要增施基肥，及时追肥，并做到氮、磷、钾肥适当配合。砂质土应多施腐熟堆肥作基肥，以增加土壤保肥力。酸性土要注意排水，增强通透性，还可适量施用石灰，以促进土内有机质分解。当稻叶因缺氮发黄时，要及时追施硫酸铵、人粪尿等速效肥。病田施用钾肥，可减轻病害。', 16);
INSERT INTO `pest` VALUES (1, '褐斑病', '东北稻区，在南方浙江也曾有发生，偏向北方稻区', '早稻育秧期间如遇低温多雨发病重，而大田期高温高湿、天气闷热，也有利于发病。', '早晚稻都可发病，多数发生在低洼受浸稻田，凡连日暴雨，受洪水淹没的田块都易发病。一般稻苗受淹后3-8天开始出现症状，发病轻重与稻苗受淹时间成正相关。早稻育秧期间如遇低温多雨发病重，而大田期高温高湿、天气闷热，也有利于发病。孕穗前后遇洪水淹涝易仗剑叶及穗部发病重。稻苗生长幼嫩的发病重，黄瘦的发病轻；矮秆品种发病重，中、高秆品种发病轻。', '/pest/bacf88ae-286f-4878-9772-25738025c7ad.jpg', '褐斑病是由丁香假单胞菌丁香致病变种引起、发生在水稻的病害，主要为害叶片、叶鞘、茎、节、穗和谷粒。', '苗期先从叶尖和叶缘开始，逐渐扩展到全叶；病斑初为褐色水渍状小点，然后扩大呈纺锤形、长椭圆形或不正形条斑，最后病斑的中心变灰褐色，组织坏死，但不穿孔。', '在台风暴雨来临前或过境后，对病田或感病品种立即全面喷药1次，特别是洪涝淹水的田块。用药次数根据病情发展情况和气候条件决定，一般间隔7-10天喷1次，发病早的喷2次，发病迟的喷1次。每亩用10%叶情双可湿性粉剂100克，70%叶枯净（又称杀枯净）胶悬剂100-150克，或25%叶枯宁可湿性粉剂100克，或50%代森铵100克（抽穗后不能用），或25%消菌灵可湿性粉剂40克，或15%消菌灵200克，以上药剂加水50升喷雾。', '检疫：加强检疫，防止病种调入和调出。农业防治：选用抗病良种；及时清除田边杂草，处理带菌稻草；浅水灌溉，防止田水串流；采用配方施肥，忌偏施氮肥等。', 17);
INSERT INTO `pest` VALUES (2, 'Hispa', '过度施肥田地', '特别是在季风前或最早的季风时期，随后是异常低的降水，昼夜温差最小。', '它可以侵扰大面积地区并造成高达20%的产量损失。', '/pest/8897f34f-0136-4980-b3c7-5e1e971d260d.jpg', '成年hispa呈方形，长宽约3-5毫米，呈深蓝色或黑色，全身都有刺。', '成年甲虫在上表皮上外部进食，沿叶子主轴形成白色平行条纹的特征图案。在严重感染的情况下，甚至静脉也会受到影响，导致出现大的白色斑点。幼虫以叶子两个表皮之间的绿色组织为食，沿着静脉隧道并造成白色斑块。', '在严重侵扰的情况下，可以使用含有以下活性成分的几种化学制剂来控制种群：毒思磷、马拉硫磷、氯氰菊酯、芬陀酸酯', '避免过度施肥。紧密的植株间距导致更大的叶密度，可以减少更高的hispa数量。为了防止害虫产卵，可以剪掉芽尖。在泥土中剪枝和掩埋枝条可使蛴螬数量减少75-92%。', 18);

-- ----------------------------
-- Table structure for user
-- ----------------------------
DROP TABLE IF EXISTS `user`;
CREATE TABLE `user`  (
  `userId` int(11) NOT NULL AUTO_INCREMENT,
  `username` varchar(20) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `password` varchar(20) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `nickname` varchar(20) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `sex` varchar(5) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `phone` varchar(20) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `email` varchar(20) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `truename` varchar(20) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `idcard` varchar(20) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `userimg` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  PRIMARY KEY (`userId`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 17 CHARACTER SET = utf8 COLLATE = utf8_general_ci ROW_FORMAT = DYNAMIC;

-- ----------------------------
-- Records of user
-- ----------------------------
INSERT INTO `user` VALUES (1, 'longhair', '123456', '长发哥', '男', '18224426754', '00nPfWxI@163.com', '单嘉', '341701201708288', '/profile/b985db99-a112-4f96-aeba-c2f8a67f7bf4.jpg');
INSERT INTO `user` VALUES (2, 'blueskyfly', '123456', '大婶', '女', '15087792240', 'iBDzzjpvop@189.com', '蓝天翔', '630224201612188', '/profile/2ff4b84b-2499-483d-89ec-3d27ce4a79fc.jpg');
INSERT INTO `user` VALUES (3, 'nightmare', '123456', '噩梦哥', '男', '19895629572', '1878985221@qq.com', '某某', '39332832838838', '/profile/649d1c6c-00f9-4d1b-9d3e-7793c51bdbf4.jpg');
INSERT INTO `user` VALUES (5, 'lwq', '123', 'nelson', '男', '11111111111', '123456@qq.com', 'lwq', '123123123123', '/profile/e2405dce-2186-40a2-8fa6-c716d692d10f.png');
INSERT INTO `user` VALUES (6, 'MySonYmx', '1234', 'son', '男', '12345678910', '14250@ymx.com', '张宇', '645753649881', '/profile/default.png');
INSERT INTO `user` VALUES (7, 'AAA农药批发', '123456', 'AAA农药批发张大龙', '男', '13812345678', '1234567890@qq.com', '张大龙', '610511199808237834', '/profile/5be60131-0ddf-4a7b-beda-7c5f5431689d.png');
INSERT INTO `user` VALUES (8, 'astray', 'astray0.0', NULL, NULL, NULL, '15235173999@139.com', NULL, NULL, '/profile/default.png');
INSERT INTO `user` VALUES (9, '啦啦啦啦', '123456', NULL, NULL, NULL, '3542164348@qq.com', NULL, NULL, '/profile/default.png');
INSERT INTO `user` VALUES (10, '素白', '123456', NULL, NULL, NULL, '3542164348@qq.com', NULL, NULL, '/profile/default.png');
INSERT INTO `user` VALUES (11, 'cxf', '111yulezhisi', NULL, NULL, NULL, '1808663789@qq.com', NULL, NULL, '/profile/default.png');
INSERT INTO `user` VALUES (12, 'cxt', '111yulezhisi', NULL, NULL, NULL, '1808663789@qq.com', NULL, NULL, '/profile/default.png');
INSERT INTO `user` VALUES (13, 'gcb', '', NULL, NULL, NULL, '', NULL, NULL, '/profile/default.png');
INSERT INTO `user` VALUES (14, '爱吃桃的林林', '2107402099', NULL, NULL, NULL, '1004978591@qq.com', NULL, NULL, '/profile/default.png');
INSERT INTO `user` VALUES (15, 'youthzlf', '13013815156', NULL, NULL, NULL, 'youthzlf@163.com', NULL, NULL, '/profile/default.png');
INSERT INTO `user` VALUES (16, 'gcbsb111', '123456789', NULL, NULL, NULL, '1174738123@qq.com', NULL, NULL, '/profile/default.png');

SET FOREIGN_KEY_CHECKS = 1;
